"""
1.通过python如何发送http请求 需要用到什么库?什么方法?

2.发送带https的数据包 报ssl验证错误如何处理？

3.实操任务 如何保存html文件到本地？（而且还要明确保存不同格式文件的保存方法 wb w,以及文件格式）

4.为了防止反扒需要设置用户代理，那如何设置用户代理

5.抓包技巧



上节课答案
1.为什么我们在浏览器输入一个网站网址就能访问对应的网站?
答 因为浏览器会将我们输入的域名传递给dns服务器，它会解析出域名（网站）对应的ip 返回给浏览器 那浏览器又拿着ip去访问服务器  达到浏览网页的效果.


2什么是http协议?
答：超文本传输协议
思维导图
https://www.processon.com/view/link/5c97952de4b0ab74ece439cd#ma


3如何实现http协议完成网络请求获取数据?
答:请求时按照http协议的规范 构建请求报文   即http工作原理


4如何打开开发者工具以及开发者工具关于爬虫抓包标签叫什么?
答：打开谷歌浏览器  按f12或者右击鼠标点击检查   抓包工具叫network


5为什么计算机能根据我们给出的中文需求返回我们对应的数据，难道计算机能识别中文吗？
答：是因为我们计算机会讲我们的中文进行编码转换为计算机能看得懂的语言 （然后再去执行我们所像完成的目的 ） 得到响应后 又将相应内容解码成我们所能看的懂的数据
即 计算机会进行自动编码和解码

"""

