
"""

2304期爬虫班级  开班典礼
流程
1.开班典礼  小事项
2.什么是爬虫
3.为什么要学习他
4.学习大纲
5.爬虫流程
6.robots协议


1.不迟到 不早退 每周上课时间 1,3,5 晚上20点到22点  大家至少要上满一小时40分钟
2.多敲代码 多练习 多看别人的代码 写自己的代码
3.课下问问题 如果没有回复 耐心等待  还是没有回复 再次提问  13:00--17:00  18:30--22:00上班时间
4.问问题的艺术
    4.1 在执行什么操作  说清楚  截图(不要断章取义的截图)最好截全屏的图 自己写了什么代码  哪一行报错了
    4.2 出了什么问题    说清楚
    4.3 具体目的是什么  说清楚  我会给出其他的解决方案
5.问问题不要问我在不在，直接把问题发给我 直接留言
6.钉钉群里面有一个   向日葵安装包.exe :作用是可以让老师远程操作你的电脑(可以查看到电脑屏幕的)
    安装方式  安装包 自己找路径安装  其他的远程软件也可以
7.钉钉群有一个 Everything.rar压缩包  自己找一个路径解压，会得到Everything.exe :作用:查询当前系统下任一文件夹下面的文件
8.作业获取 >> (钉钉群作业文件夹"(爬虫(作业)")) 交作业 >>发qq邮箱@3569974821  作业会统一批给
    自己锻炼一下使用工具的能力  查一下如何使用QQ邮箱发送邮件
9.录播获取 >>(钉钉群有回放) 也可以找班主任获取
10.网课没有声音 及时提出
11.如果发现在知识点学习的过程中 掉队了(A,B,C),(C突然忘了) 可以在课间休息时候提出 或者课后提出
12.代码和课件获取>>>钉钉群爬虫(代码)文件夹和爬虫(课件)文件夹

要点
1.按时完成作业(有时间)
2.上直播(录播)把每一节课上完  最后面会有一个测试(检测爬虫知识点的检测情况)
3.上不了课  跟班主任请假  提前说出原因


忠告
请务必按时看直播或者录播完成自己的学习课程   这是对当初理性投资的负责

lua  c#
爬虫违法吗？
爬虫相当于是模仿用户发送请求  如果访问次数多导致服务器宕机  是wf的!
需要注意频率


python可以制作网页吗？
可以  可以使用 django flask

用手点击抢票按钮 发送一次https请求
爬虫是讲如何构建https请求!



opencv识别视频里面的物体(人)

"""
